//****************************************************************************************************************************************************
//***Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B. Решить задачу с использованием методов.***
//****************************************************************************************************************************************************
/*

int exp(int eA, int eB)
{
     int result = 1;
         for (int i=0; i < eB; i++)
          {
            result=result*eA;
          }     
     return result;
}
Console.Write("Введите число А: ");
int a = int.Parse(Console.ReadLine()); 
Console.Write("Введите число B: ");
int b = int.Parse(Console.ReadLine()); 
int res=exp(a,b);
Console.Write($"Число {a} в степени {b} = {res}");
*/

//*************************************************************************************************************************************************
//*********************************Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе*********************************
//*************************************************************************************************************************************************
/*
int sumnum(int num)
{
    num = Math.Abs(num);
     int sum = 0;
     while (num > 0)
     {
       sum=sum+num%10;
       num=num/10;
     }
return sum;
}

Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine()); 
int result=sumnum(number);
Console.Write($"Сумма цифр в числе {number} = {result} ");
*/
//*************************************************************************************************************************************************
//************* Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран. Элементы массива вводятся пользователем.***********
//*************************************************************************************************************************************************

/*
Console.WriteLine("Введите массив из 8 элементов:");
 int [] mass = new int [8];
for (int i=0; i < 8; i++)
 {
  Console.Write($"mas[{i}]=");
  mass[i] = int.Parse(Console.ReadLine());
 }

Console.Write($"Полученный массив:");
 for (int i=0; i < 8; i++)
 {
  Console.Write($"{mass[i]} ");
 }

 */
