//*****************************************************************************************************************************************
//*******************Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.****************
//*****************************************************************************************************************************************
/*
int Getcount(int m)
{
    int count=0;
    Console.WriteLine("Вводите числа: ");
    for (int i = 0; i < m; i++)
    {
       if (int.Parse(Console.ReadLine()) > 0)
        count++;
    }
    return count;
}
Console.Write("Укажите количество вводимых чисел: ");
int m = int.Parse(Console.ReadLine());
int result = Getcount(m);
Console.Write($"Количество чисел больше 0 равно {result} ");
*/

//*****************************************************************************************************************************************
//************Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2;*****
//*********** значения b1, k1, b2 и k2 задаются пользователем.b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)*******************************
//*****************************************************************************************************************************************

Console.Write("Укажите значение b1 ");
double b1 = double.Parse(Console.ReadLine());

Console.Write("Укажите значение k1 ");
double k1 = double.Parse(Console.ReadLine());

Console.Write("Укажите значение b2 ");
double b2 = double.Parse(Console.ReadLine());

Console.Write("Укажите значение k2 ");
double k2 = double.Parse(Console.ReadLine());

double x=0;
double y=0;
if ((k1==k2) && (b1==b2)) 
    {
        Console.Write("Прямые совпали");
    }
else 
    {
        if (b1==b2) 
        {
            Console.Write("Прямые паралельны");
        }
        else
        {
        x = (b2-b1)/(k1-k2);
        y = (k1*(b2-b1))/(k1-k2)+b1;
        } 
    Console.Write($"Точка пересечения ({x};{y}) ");

    }
